In [3]:
import pandas as pd
import numpy as np

# Creating a dataframe from an array

# option1

In [4]:
# Creating an array
data = np.array([[1,4], [2,5], [3,6]])

In [5]:
# creating a dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'],
                    columns = ['col1', 'col2'])

In [6]:
# showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# Option2

In [7]:
# Creating an array with list shape
data = [[1,4], [2,5], [3,6]]

In [8]:
# creating a dataframe
df = pd.DataFrame(data, index = ['row1', 'row2', 'row3'],
                    columns = ['col1', 'col2'])

In [9]:
# showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# Creating a DataFrame from a dictionary

In [10]:
#List used for this example
states = ['California', 'Texas', 'Florida', 'New York']
population = [3961, 2973, 2194, 1929]

In [11]:
# Storing lists within a dictionary
dict_states = {"States": states, "Population":population}

In [12]:
#Creating the df
df_population = pd.DataFrame(dict_states)

In [13]:
# Showing the dataframes
df_population

       States  Population
0  California        3961
1       Texas        2973
2     Florida        2194
3    New York        1929

# Creating a DataFrame from a csv file

In [24]:
# reading the csv file
df = pd.read_csv(r'D:\py with DA\Python-with-data-analysis\dataset\StudentsPerformance.csv')

In [25]:
# show first 5 rows in a dataframe
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [17]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [19]:
# show last 5 rows in a dataframe
df.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [21]:
# getting access to the shape attribute
df.shape

(1000, 8)

In [23]:
# display n rows
pd.set_option('display.max_rows', 100)
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86